from pypdf import PdfReader, PdfWriter

# 🔧 НАСТРОЙКИ (просто поменяй строки ниже один раз и больше не трогаешь код)
INPUT_PDF_PATH = r"C:\MISIS\graph\text_2.pdf"          # путь к исходному PDF
OUTPUT_PDF_PATH = r"C:\MISIS\graph\text_2_clean.pdf"   # путь к сохранению нового PDF
PAGES_TO_DELETE = [1, 27, 29, 42, 51, 64, 70, 73, 80, 88, 89, 90, 91, 95, 99, 108, 120, 123, 124, 125, 126, 127, 134, 136, 137, 142, 144, 157, 164, 167, 171,
                185, 186, 187, 188, 189, 191, 199, 200, 204, 207, 215, 217, 222, 234, 236, 242, 243, 245, 248, 249, 250, 251, 254, 256, 294, 295,
                313, 314, 315, 326, 332, 356, 364, 369, 370, 377, 380, 381, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397,
                398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431 ]  # какие страницы удалить (нумерация с 1, как в просмотрщике)

def remove_pages():
    reader = PdfReader(INPUT_PDF_PATH)
    writer = PdfWriter()

    # Преобразуем список страниц к 0-индексации
    pages_to_remove_zero = {p - 1 for p in PAGES_TO_DELETE}

    for i, page in enumerate(reader.pages):
        if i not in pages_to_remove_zero:
            writer.add_page(page)

    with open(OUTPUT_PDF_PATH, "wb") as f:
        writer.write(f)

    print("Готово! Файл сохранён как:", OUTPUT_PDF_PATH)


if __name__ == "__main__":
    remove_pages()